Repository: wwaramii/locket
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: fa, ru

source: <b>1️⃣ Please enter a title for the password: </b>
fa: <b>1️⃣ لطفاً یک عنوان برای رمز عبور وارد کنید: </b>
ru: <b>1️⃣ Пожалуйста, введите заголовок для пароля: </b>

source: <b>❗ This title is too long(max 45 characters).</b> 1️⃣ Re-enter a <b>shorter</b> password:
fa: <b>❗ این عنوان خیلی طولانی است (حداکثر ۴۵ کاراکتر).</b> 1️⃣ لطفاً یک رمز عبور <b>کوتاه‌تر</b> دوباره وارد کنید:
ru: <b>❗ Этот заголовок слишком длинный (максимум 45 символов).</b> 1️⃣ Введите <b>более короткий</b> заголовок:

source: <b>2️⃣ Now enter the password: </b>
fa: <b>2️⃣ حالا رمز عبور را وارد کنید: </b>
ru: <b>2️⃣ Теперь введите пароль: </b>

source: <b>😞 Something went wrong!</b> You can try again using /use .
fa: <b>😞 مشکلی پیش آمد!</b> می‌توانید دوباره با استفاده از /use امتحان کنید.
ru: <b>😞 Что-то пошло не так!</b> Вы можете попробовать снова, используя /use .

source: <b>Password was safely added to the pack🎉</b> You can access it threw /use or the below button..
fa: <b>رمز عبور با موفقیت به بسته اضافه شد🎉</b> می‌توانید با استفاده از /use یا دکمه زیر به آن دسترسی پیدا کنید.
ru: <b>Пароль успешно добавлен в пакет🎉</b> Вы можете получить к нему доступ через /use или кнопку ниже..

source: <b>✅ Your password </b><i>{title}</i> <b>was successfully deleted.</b>
fa: <b>✅ پسورد شما </b><i>{title}</i> <b>با موفقیت حذف شد.</b>
ru: <b>✅ Ваш пароль </b><i>{title}</i> <b>был успешно удален.</b>

source: <b>❗ We wasn't able to delete your password.</b>
fa: <b>❗ ما نتوانستیم رمز عبور شما را حذف کنیم.</b>
ru: <b>❗ Мы не смогли удалить ваш пароль.</b>

source: <b>🤔 Something was'nt right.</b> Logout with /use and re-login to fix the issue or contact support.
fa: <b>🤔 مشکلی پیش آمد.</b> با /use خارج شوید و دوباره وارد شوید تا مشکل برطرف شود یا با پشتیبانی تماس بگیرید.
ru: <b>🤔 Что-то пошло не так.</b> Выйдите из системы с помощью /use и снова войдите, чтобы исправить проблему, или свяжитесь с поддержкой.

source: <b>🔑 Your stored password:</b> <b>📌 Title:</b> {title} {fields} 🕑 This message will be deleted after <b>1 minute</b>.
fa: <b>🔑 رمز عبور ذخیره‌شده شما:</b> <b>📌 عنوان:</b> {title} {fields} 🕑 این پیام پس از <b>۱ دقیقه</b> حذف خواهد شد.
ru: <b>🔑 Ваш сохраненный пароль:</b> <b>📌 Заголовок:</b> {title} {fields} 🕑 Это сообщение будет удалено через <b>1 минуту</b>.

source: <b>❗ Try accessing your password threw /use.</b>
fa: <b>❗ با استفاده از /use به رمز عبور خود دسترسی پیدا کنید.</b>
ru: <b>❗ Попробуйте получить доступ к вашему паролю через /use.</b>

source: Operation canceled...
fa: عملیات لغو شد...
ru: Операция отменена...

source: <b>🔒 Locket</b> is the <b>safest</b> and <b>smoothest</b> password manager on Telegram. 🔰 <b>Locket</b> ensures your passwords are always secure and accessible only by you. Here’s how we do it: 🔹 <b>Encrypted data:</b> No raw passwords are stored. 🔹 <b>Owner-only access:</b> Only the data owner can access their information. 🔹 <b>Anonymized data:</b> It's impossible to determine which data belongs to which user. 🔹 <b>Open source:</b> <b>Locket</b> is fully transparent and <a href="https://github.com/wwaramii/locket">open source</a>. ✅ Your data is completely safe. 🔰 Start using Locket by creating a new password pack with the /new command. Keep your secret phrase safe, and access or store all your secrets with /use. 🖤 Enjoy Locket!
fa: <b>🔒 لاکت</b> امن‌ترین و روان‌ترین مدیر رمز عبور در تلگرام است. 🔰 <b>لاکت</b> اطمینان حاصل می‌کند که رمزهای عبور شما همیشه ایمن و فقط برای شما قابل دسترسی باشند. اینجا چگونگی این کار را می‌گوییم: 🔹 <b>داده‌های رمزگذاری‌شده:</b> هیچ رمز عبور خامی ذخیره نمی‌شود. 🔹 <b>دسترسی فقط برای مالک:</b> تنها مالک داده می‌تواند به اطلاعات خود دسترسی داشته باشد. 🔹 <b>داده‌های ناشناس:</b> امکان تعیین اینکه کدام داده به کدام کاربر تعلق دارد وجود ندارد. 🔹 <b>متن‌باز:</b> <b>لاکت</b> کاملاً شفاف و <a href="https://github.com/wwaramii/locket">متن‌باز</a> است. ✅ داده‌های شما کاملاً ایمن هستند. 🔰 استفاده از لاکت را با ایجاد یک بسته رمز عبور جدید با فرمان /new آغاز کنید. کلید محرمانه خود را ایمن نگه دارید و با استفاده از /use به تمام رازهای خود دسترسی پیدا کنید یا آنها را ذخیره کنید. 🖤 از لاکت لذت ببرید!

source: <b>🔐 To access a document pack, please enter its secret key.</b> You'll gain access to all passwords stored in the pack. <b>Enter the secret phrase:</b>
fa: <b>🔐 برای دسترسی به بسته اسناد، لطفاً کلید محرمانه آن را وارد کنید.</b> شما به همه رمزهای عبور ذخیره‌شده در بسته دسترسی خواهید داشت. <b>عبارت محرمانه را وارد کنید:</b>
ru: <b>🔐 Для доступа к пакету документов введите его секретный ключ.</b> Вы получите доступ ко всем паролям, хранящимся в пакете. <b>Введите секретную фразу:</b>

source: <b>You successfully logged in! 🎉</b> You can now access all passwords stored in this pack with /use. <b>You will stay logged in for 5 minutes.</b> <b>🔒 Enjoy your secure experience!</b>
fa: <b>شما با موفقیت وارد شدید! 🎉</b> اکنون می‌توانید با /use به همه رمزهای عبور ذخیره‌شده در این بسته دسترسی داشته باشید. <b>شما به مدت ۵ دقیقه وارد سیستم خواهید ماند.</b> <b>🔒 از تجربه امن خود لذت ببرید!</b>
ru: <b>Вы успешно вошли в систему! 🎉</b> Теперь вы можете получить доступ ко всем паролям, хранящимся в этом пакете, с помощью /use. <b>Вы останетесь в системе в течение 5 минут.</b> <b>🔒 Наслаждайтесь безопасным опытом!</b>

source: <b>❗️ Invalid secret key. Please try again /use.</b>
fa: ❗️ کلید محرمانه معتبر نیست. لطفا دوباره تلاش کنید /use.
ru: <b>❗️ Неверный секретный ключ. Пожалуйста, попробуйте снова /use.</b>

source: Logged out...
fa: خارج شدید...
ru: Выход выполнен...

source: <b>Pack created! 🎉</b> You can now store your passwords securely. Remember to keep your secret key safe, as it's the only way to access your pack. <b>Without it, your passwords are lost.</b> ⛔️ <b>Secret key:</b> {secret_key} - You can start using this pack with /use . 🕑 This message will be deleted after <b>2 minutes</b>.
fa: <b>بسته ایجاد شد! 🎉</b> اکنون می‌توانید رمزهای عبور خود را به‌طور امن ذخیره کنید. به خاطر داشته باشید که کلید محرمانه خود را ایمن نگه دارید، زیرا تنها راه دسترسی به بسته شماست. <b>بدون آن، رمزهای عبور شما از دست خواهند رفت.</b> ⛔️ <b>کلید محرمانه:</b> {secret_key} - می‌توانید با /use استفاده از این بسته را شروع کنید. 🕑 این پیام پس از <b>۲ دقیقه</b> حذف خواهد شد.
ru: <b>Пакет создан! 🎉</b> Теперь вы можете безопасно хранить свои пароли. Помните, что важно хранить ваш секретный ключ в безопасности, так как это единственный способ получить доступ к вашему пакету. <b>Без него ваши пароли будут потеряны.</b> ⛔️ <b>Секретный ключ:</b> {secret_key} - Вы можете начать использовать этот пакет с помощью /use . 🕑 Это сообщение будет удалено через <b>2 минуты</b>.

source: <b>🔓 You are logged in and have access to your passwords.</b> - You will stay logged in for 5 minutes. - You can logout and access other packs. <b>📌 All passwords in this pack are listed.</b> You can access each one by tapping it:
fa: <b>🔓 شما وارد شده‌اید و به رمزهای عبور خود دسترسی دارید.</b> - شما به مدت ۵ دقیقه وارد سیستم خواهید ماند. - می‌توانید خارج شوید و به بسته‌های دیگر دسترسی پیدا کنید. <b>📌 تمام رمزهای عبور در این بسته لیست شده‌اند.</b> می‌توانید با ضربه زدن روی هر کدام به آن دسترسی پیدا کنید:
ru: <b>🔓 Вы вошли в систему и имеете доступ к своим паролям.</b> - Вы останетесь в системе в течение 5 минут. - Вы можете выйти из системы и получить доступ к другим пакетам. <b>📌 Все пароли в этом пакете перечислены.</b> Вы можете получить доступ к каждому из них, нажав на него:

source: ➕ Add password
fa: ➕ افزودن رمز عبور
ru: ➕ Добавить пароль

source: 🚪 Logout
fa: 🚪 خروج
ru: 🚪 Выйти

source: ⬅️ Last page
fa: صفحه قبل ⬅️
ru: ⬅️ Последняя страница

source: ➡️ Next page
fa: ➡️ صفحه بعد
ru: ➡️ Следующая страница

source: Welcome {name}👋! <b>🔒 This is a secure and fast password manager bot. It's easy to use and keeps your data safe.</b> 🪄 Commands: /start - Main menu /new - Create a new document pack /use - Use an existing document pack /info - Get info about how the bot works
fa: خوش آمدید {name}👋! <b>🔒 این یک ربات مدیریت رمز عبور سریع و امن است. استفاده از آن آسان است و اطلاعات شما را ایمن نگه می‌دارد.</b> 🪄 دستورات: /start - منوی اصلی /new - ایجاد یک بسته جدید /use - استفاده از یک بسته موجود /info - دریافت اطلاعات در مورد نحوه کار ربات
ru: Добро пожаловать, {name}👋! <b>🔒 Это безопасный и быстрый бот для управления паролями. Он прост в использовании и обеспечивает безопасность ваших данных.</b> 🪄 Команды: /start - Главное меню /new - Создать новый пакет документов /use - Использовать существующий пакет документов /info - Получить информацию о работе бота

source: • Main menu | Bot main menu
fa: • منوی اصلی | منوی اصلی ربات
ru: • Главное меню | Главное меню бота

source: • New | Create new pack
fa: • جدید | ایجاد یک بسته جدید
ru: • Новый | Создать новый пакет

source: • Use | Use an available pack
fa: • استفاده | استفاده از یک بسته موجود
ru: • Использовать | Использовать доступный пакет

source: • Info | How am I safe here?
fa: • راهنمایی | چگونه در اینجا ایمن هستم؟
ru: • Информация | Как я защищен здесь?

source: ❌ Delete Message Now!
fa: ❌ پیام را الان حذف کن!
ru: ❌ Удалить сообщение сейчас!

source: 🔚 Cancel
fa: 🔚 لغو
ru: 🔚 Отмена

source: ❌ Delete password {title}
fa: ❌ حذف رمز عبور {title}
ru: ❌ Удалить пароль {title}

source: 🤖 Generate Secure Password
fa: 🤖 تولید رمز عبور امن
ru: 🤖 Сгенерировать безопасный пароль

source: <b>❗️ You are not logged in!</b> With /use you can login and access your passwords.
fa: <b>❗️ شما وارد نشده‌اید!</b> با استفاده از /use می‌توانید وارد شوید و به رمزهای عبور خود دسترسی پیدا کنید.
ru: <b>❗️ Вы не вошли в систему!</b> С помощью /use вы можете войти в систему и получить доступ к своим паролям.

source: <b>❗ You are not logged in or you don't have access to this password.</b> You can simply login with /use and access your stored passwords. Or you can create a pack for storing your password with /new .
ru: <b>❗ Вы не вошли в систему или у вас нет доступа к этому паролю.</b> Вы можете просто войти с помощью /use и получить доступ к вашим сохраненным паролям. Или вы можете создать пакет для хранения вашего пароля с помощью /new .
